In [11]:
import pandas as pd

In [12]:
india_weather = pd.DataFrame({
    'city':['Mumbai','Delhi','Bangalore'],
    'temperature':[32,40,42],
    'humidity':[80,60,78]
})
india_weather

        city  temperature  humidity
0     Mumbai           32        80
1      Delhi           40        60
2  Bangalore           42        78

In [13]:
us_weather = pd.DataFrame({
    'city':['New York','Chicago','Orlando'],
    'temperature':[21,14,35],
    'humidity':[68,65,75]
})
us_weather

       city  temperature  humidity
0  New York           21        68
1   Chicago           14        65
2   Orlando           35        75

In [14]:
new_df = pd.concat([india_weather,us_weather], ignore_index=True)

In [17]:
new_df = pd.concat([india_weather,us_weather], keys=['India','USA'])
new_df

              city  temperature  humidity
India 0     Mumbai           32        80
      1      Delhi           40        60
      2  Bangalore           42        78
USA   0   New York           21        68
      1    Chicago           14        65
      2    Orlando           35        75

In [19]:
new_df.loc["USA"]

       city  temperature  humidity
0  New York           21        68
1   Chicago           14        65
2   Orlando           35        75

In [27]:
temperature_df = pd.DataFrame({
    'city':['Mumbai','Delhi','Bangalore'],
    'temperature':[32,45,30]
}, index=[0,1,2])
temperature_df

        city  temperature
0     Mumbai           32
1      Delhi           45
2  Bangalore           30

In [32]:
windspeed_df = pd.DataFrame({
    'city':['Delhi','Bangalore'],
    'windspeed':[6,4]
}, index=[1,2])
windspeed_df

        city  windspeed
1      Delhi          6
2  Bangalore          4

In [34]:
new_df = pd.concat([temperature_df,windspeed_df], axis=1)
new_df

        city  temperature       city  windspeed
0     Mumbai           32        NaN        NaN
1      Delhi           45      Delhi        6.0
2  Bangalore           30  Bangalore        4.0

In [36]:
temperature_df

        city  temperature
0     Mumbai           32
1      Delhi           45
2  Bangalore           30

In [40]:
s = pd.Series(['Humid','Dry','Rain'], name='event')
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [41]:
new_df = pd.concat([temperature_df,s], axis=1)
new_df

        city  temperature  event
0     Mumbai           32  Humid
1      Delhi           45    Dry
2  Bangalore           30   Rain